SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/efr32xg2x/sl_rail_chip_specific.h
/***************************************************************************//**
 * @file
 * @brief This file contains the type definitions for EFR32xG2x chip-specific
 *   aspects of RAIL.
 *******************************************************************************
 * # License
 * <b>Copyright 2024 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifdef  SLI_LIBRARY_BUILD

// This file should not be included when doing SLI_LIBRARY_BUILDs

#else//!SLI_LIBRARY_BUILD

#ifndef SL_RAIL_CHIP_SPECIFIC_H
#if !defined(SL_RAIL_TYPES_H) && !defined(DOXYGEN_SHOULD_SKIP_THIS)
#warning sl_rail_chip_specific.h should only be included by sl_rail_types.h
#include "sl_rail_types.h" // Force sl_rail_chip_specific.h only within sl_rail_types.h
#else // SL_RAIL_TYPES_H
/// Include guard
#define SL_RAIL_CHIP_SPECIFIC_H

#include "sl_rail_features.h"
#ifdef RAIL_INTERNAL_BUILD
#include "sl_rail_chip_specific_internal.h"
#endif

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************
 * General Structures
 *****************************************************************************/
/**
 * @addtogroup General_EFR32XG2X EFR32xG2x
 * @ingroup General
 * @{
 * @brief Types specific to the EFR32xG2x for general configuration.
 */

#ifndef DOXYGEN_UNDOCUMENTED

/**
 * @def SL_RAIL_EFR32XG21_STATE_BUFFER_BYTES
 * @brief The EFR32xG21 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG21_STATE_BUFFER_BYTES 592

/**
 * @def SL_RAIL_EFR32XG22_STATE_BUFFER_BYTES
 * @brief The EFR32xG22 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG22_STATE_BUFFER_BYTES 608

/**
 * @def SL_RAIL_EFR32XG23_STATE_BUFFER_BYTES
 * @brief The EFR32xG23 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG23_STATE_BUFFER_BYTES 616

/**
 * @def SL_RAIL_EFR32XG24_STATE_BUFFER_BYTES
 * @brief The EFR32xG24 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG24_STATE_BUFFER_BYTES 632

/**
 * @def SL_RAIL_EFR32XG25_STATE_BUFFER_BYTES
 * @brief The EFR32xG25 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG25_STATE_BUFFER_BYTES 632

/**
 * @def SL_RAIL_EFR32XG26_STATE_BUFFER_BYTES
 * @brief The EFR32xG26 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG26_STATE_BUFFER_BYTES 632

/**
 * @def SL_RAIL_EFR32XG27_STATE_BUFFER_BYTES
 * @brief The EFR32xG27 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG27_STATE_BUFFER_BYTES 608

/**
 * @def SL_RAIL_EFR32XG28_STATE_BUFFER_BYTES
 * @brief The EFR32xG28 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG28_STATE_BUFFER_BYTES 624

/**
 * @def SL_RAIL_EFR32XG29_STATE_BUFFER_BYTES
 * @brief The EFR32xG29 series size needed for
 *   \ref sl_rail_state_buffer_entry_t::buffer_bytes.
 */
#define SL_RAIL_EFR32XG29_STATE_BUFFER_BYTES 608

#ifndef SL_RAIL_STATE_BUFFER_BYTES
/**
 * @def SL_RAIL_STATE_BUFFER_BYTES
 * @brief The size needed for \ref sl_rail_state_buffer_entry_t::buffer_bytes
 *   on this platform for this radio. This compile-time size may be slightly
 *   larger than what \ref sl_rail_get_state_buffer_bytes() determines at run-time.
 */
#if (_SILICON_LABS_32B_SERIES_2_CONFIG == 1)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG21_STATE_BUFFER_BYTES
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 2)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG22_STATE_BUFFER_BYTES
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 3)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG23_STATE_BUFFER_BYTES
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 4)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG24_STATE_BUFFER_BYTES
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 5)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG25_STATE_BUFFER_BYTES
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 6)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG26_STATE_BUFFER_BYTES
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 7)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG27_STATE_BUFFER_BYTES
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 8)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG28_STATE_BUFFER_BYTES
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 9)
#define SL_RAIL_STATE_BUFFER_BYTES SL_RAIL_EFR32XG29_STATE_BUFFER_BYTES
#else
#define SL_RAIL_STATE_BUFFER_BYTES 0 // Sate Doxygen
#error "Unsupported platform!"
#endif
#endif //#ifndef SL_RAIL_STATE_BUFFER_BYTES

#endif//DOXYGEN_UNDOCUMENTED

#ifndef DOXYGEN_UNDOCUMENTED

/**
 * @def SL_RAIL_SEQ_IMAGE_0
 * @brief A macro for the primary sequencer image.
 */
#define SL_RAIL_SEQ_IMAGE_0 1

/**
 * @def SL_RAIL_SEQ_IMAGE_1
 * @brief A macro for the alternate sequencer image.
 */
#define SL_RAIL_SEQ_IMAGE_1 2

#ifndef RAIL_INTERNAL_BUILD
#if ((_SILICON_LABS_32B_SERIES_2_CONFIG == 4) || (_SILICON_LABS_32B_SERIES_2_CONFIG == 6))
/**
 * @def SL_RAIL_SEQ_IMAGE_PA_10_DBM
 * @brief A chip-specific macro for the sequencer image used on EFR32xG24 and EFR32xG26 OPNs
 *   with a 10 dBm PA.
 */
#define SL_RAIL_SEQ_IMAGE_PA_10_DBM SL_RAIL_SEQ_IMAGE_0

/**
 * @def SL_RAIL_SEQ_IMAGE_PA_20_DBM
 * @brief A chip-specific macro for the sequencer image used on EFR32xG24 and EFR32xG26 OPNs
 *   with a 20 dBm PA.
 */
#define SL_RAIL_SEQ_IMAGE_PA_20_DBM SL_RAIL_SEQ_IMAGE_1

/**
 * @def SL_RAIL_SEQ_IMAGE_COUNT
 * @brief A macro for the total number of sequencer images supported on the
 *   platform.
 */
#define SL_RAIL_SEQ_IMAGE_COUNT 2

#else //((_SILICON_LABS_32B_SERIES_2_CONFIG != 4) && (_SILICON_LABS_32B_SERIES_2_CONFIG != 6))

/**
 * @def SL_RAIL_SEQ_IMAGE_DEFAULT
 * @brief A chip-specific macro for the default sequencer image on platforms
 *   that support only one sequencer image.
 */
#define SL_RAIL_SEQ_IMAGE_DEFAULT SL_RAIL_SEQ_IMAGE_0

/**
 * @def SL_RAIL_SEQ_IMAGE_COUNT
 * @brief A macro for the total number of sequencer images supported on the
 *   platform.
 */
#define SL_RAIL_SEQ_IMAGE_COUNT 1
#endif //((_SILICON_LABS_32B_SERIES_2_CONFIG == 4) || (_SILICON_LABS_32B_SERIES_2_CONFIG == 6))
#endif //RAIL_INTERNAL_BUILD

/**
 * @struct sl_rail_rffpll_config_t
 * @brief Stores information relevant to the Radio-Friendly Frequency
 *   Phase-Locked Loop (RFFPLL) for the PHY configuration currently loaded in
 *   memory.
 */
typedef struct {
  /** Divider X (Modem Clock), Divider Y (M33 System Clock), and Divider N (Feedback) values. */
  uint32_t dividers;
  /** Radio clock frequency in Hz. */
  uint32_t radio_freq_hz;
  /** System clock frequency in Hz. */
  uint32_t sysclk_freq_hz;
} sl_rail_rffpll_config_t;

/**
 * @def SL_RAIL_RFFPLL_DIVIDERX_MASK
 * @brief Bit mask for RFFPLL DIVX in \ref sl_rail_rffpll_config_t::dividers.
 */
#define SL_RAIL_RFFPLL_DIVIDERX_MASK   0x000000FFUL

/**
 * @def SL_RAIL_RFFPLL_DIVIDERX_SHIFT
 * @brief Shift value for RFFPLL DIVX in \ref sl_rail_rffpll_config_t::dividers.
 */
#define SL_RAIL_RFFPLL_DIVIDERX_SHIFT  0

/**
 * @def SL_RAIL_RFFPLL_DIVIDERY_MASK
 * @brief Bit mask for RFFPLL DIVY in \ref sl_rail_rffpll_config_t::dividers.
 */
#define SL_RAIL_RFFPLL_DIVIDERY_MASK   0x0000FF00UL

/**
 * @def SL_RAIL_RFFPLL_DIVIDERY_SHIFT
 * @brief Shift value for RFFPLL DIVY in \ref sl_rail_rffpll_config_t::dividers.
 */
#define SL_RAIL_RFFPLL_DIVIDERY_SHIFT  8

/**
 * @def SL_RAIL_RFFPLL_DIVIDERN_MASK
 * @brief Bit mask for RFFPLL DIVN in \ref sl_rail_rffpll_config_t::dividers.
 */
#define SL_RAIL_RFFPLL_DIVIDERN_MASK   0x00FF0000UL

/**
 * @def SL_RAIL_RFFPLL_DIVIDERN_SHIFT
 * @brief Shift value for RFFPLL DIVN in \ref sl_rail_rffpll_config_t::dividers.
 */
#define SL_RAIL_RFFPLL_DIVIDERN_SHIFT  16

/**
 * @typedef sl_rail_timer_tick_t
 * @brief Internal RAIL hardware timer tick that drives the RAIL timebase.
 *   A tick is roughly 0.5 microseconds but it wraps somewhat before
 *   0xFFFFFFFF giving a time range of about 17 minutes.
 *
 * @note \ref sl_rail_timer_ticks_to_us() can be used to convert the delta between
 *   two \ref sl_rail_timer_tick_t values to microseconds.
 */
typedef uint32_t sl_rail_timer_tick_t;

/**
 * @def sl_rail_get_timer_tick(timer_tick_type)
 * @brief The RAIL hardware timer ticks value.
 *
 * @note timer_tick_type is added for compatibility reasons and is ignored here;
 *   this gets the equivalent of \ref SL_RAIL_TIMER_TICK_DEFAULT.
 */
#define sl_rail_get_timer_tick(timer_tick_type) (*sl_rail_timer_tick)

/**
 * A global pointer to the memory address of the 32-bit
 * \ref sl_rail_timer_tick_t internal RAIL hardware timer that drives
 * the RAIL timebase.
 * Equivalent to \ref sl_rail_timer_tick_t for its granularity and range.
 */
extern volatile uint32_t * const sl_rail_timer_tick;

/**
 * A global pointer to the memory address of the internal RAIL hardware timer
 * that captures the latest RX packet reception time.
 * See \ref sl_rail_timer_tick_t for its granularity and range.
 *
 * @note This would not include the RX chain delay, so may not exactly
 *   correspond to the \ref sl_rail_time_t packet timestamp available within
 *   \ref sl_rail_rx_packet_details_t::time_received which reflects the actual
 *   on-air time that the packet finished.
 */
extern volatile uint32_t * const sl_rail_rx_packet_timestamp;

/**
 * Get elapsed time, in microseconds, between two \ref sl_rail_timer_tick_t ticks.
 *
 * @param[in] start_tick Tick recorded at the start of the operation.
 * @param[in] end_tick Tick recorded at the end of the operation.
 * @return The elapsed time, in microseconds, between two timer ticks.
 */
sl_rail_time_t sl_rail_timer_ticks_to_us(sl_rail_timer_tick_t start_tick,
                                         sl_rail_timer_tick_t end_tick);

/**
 * Get \ref sl_rail_timer_tick_t tick corresponding to a \ref sl_rail_time_t time.
 *
 * @param[in] microseconds Time in microseconds.
 * @return The \ref sl_rail_timer_tick_t tick corresponding to the
 *   \ref sl_rail_time_t time.
 */
sl_rail_timer_tick_t sl_rail_us_to_timer_ticks(sl_rail_time_t microseconds);

#endif//DOXYGEN_UNDOCUMENTED

/** @} */ // end of group General_EFR32XG2X

