SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/efr32xg2x/sl_rail_chip_specific.h
/******************************************************************************
 * Multiprotocol
 *****************************************************************************/
/**
 * @addtogroup Multiprotocol_EFR32XG2X EFR32xG2x
 * @ingroup Multiprotocol
 * @{
 * @brief EFR32xG2x-specific multiprotocol support defines.
 */

/**
 * @def SL_RAIL_TRANSITION_TIME_US
 * @brief Time it takes to take care of protocol switching.
 */
#if _SILICON_LABS_32B_SERIES_2_CONFIG > 1
// XG22 + devices
#define SL_RAIL_TRANSITION_TIME_US 510
#else
// XG21
#define SL_RAIL_TRANSITION_TIME_US 500
#endif

/** @} */ // end of group Multiprotocol_EFR32XG2X

/******************************************************************************
 * Calibration
 *****************************************************************************/
/**
 * @addtogroup Calibration_EFR32XG2X EFR32xG2x
 * @ingroup Calibration
 * @{
 * @brief EFR32xG2x-specific Calibrations.
 */

/**
 * @def SL_RAIL_RF_PATHS_2P4_GHZ
 * @brief Indicates the number of 2.4 GHz RF Paths suppported.
 */
#ifndef SL_RAIL_RF_PATHS_2P4_GHZ
#if ((_SILICON_LABS_32B_SERIES_2_CONFIG == 1) || (_SILICON_LABS_32B_SERIES_2_CONFIG == 4) || (_SILICON_LABS_32B_SERIES_2_CONFIG == 6))
#define SL_RAIL_RF_PATHS_2P4_GHZ 2
#elif ((_SILICON_LABS_32B_SERIES_2_CONFIG == 2) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 7)   \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 9)   \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 8))
#define SL_RAIL_RF_PATHS_2P4_GHZ 1
#else
#define SL_RAIL_RF_PATHS_2P4_GHZ 0
#endif
#endif//SL_RAIL_RF_PATHS_2P4GHZ

/**
 * @def SL_RAIL_RF_PATHS_SUB_GHZ
 * @brief Indicates the number of Sub-GHz RF Paths supported.
 */
#ifndef SL_RAIL_RF_PATHS_SUB_GHZ
#if _SILICON_LABS_32B_SERIES_2_CONFIG == 3
#define SL_RAIL_RF_PATHS_SUB_GHZ 2
#elif  _SILICON_LABS_32B_SERIES_2_CONFIG == 5
#define SL_RAIL_RF_PATHS_SUB_GHZ 2
#elif _SILICON_LABS_32B_SERIES_2_CONFIG == 8
#define SL_RAIL_RF_PATHS_SUB_GHZ 1
#else
#define SL_RAIL_RF_PATHS_SUB_GHZ 0
#endif
#endif//SL_RAIL_RF_PATHS_SUB_GHZ

/**
 * @def SL_RAIL_RF_PATHS
 * @brief Indicates the number of RF Paths supported.
 */
#define SL_RAIL_RF_PATHS (SL_RAIL_RF_PATHS_SUB_GHZ + SL_RAIL_RF_PATHS_2P4_GHZ)

#if     (SL_RAIL_RF_PATHS > SL_RAIL_MAX_RF_PATHS)
#error "Update sl_rail_types.h SL_RAIL_MAX_RF_PATHS"
#endif

/**
 * @def SL_RAIL_RADIO_CONFIG_ENABLE_IR_CAL_MULTIPLE_RF_PATHS
 * @brief Indicates this version of RAIL supports IR calibration on multiple RF paths
 * Needed for backwards compatibility.
 */
#if SL_RAIL_RF_PATHS > 1
#define SL_RAIL_RADIO_CONFIG_ENABLE_IR_CAL_MULTIPLE_RF_PATHS 1
#else
#ifdef  DOXYGEN_SHOULD_SKIP_THIS // Leave undefined except for doxygen
#define SL_RAIL_RADIO_CONFIG_ENABLE_IR_CAL_MULTIPLE_RF_PATHS 0
#endif //DOXYGEN_SHOULD_SKIP_THIS
#endif //SL_RAIL_RF_PATHS

/**
 * @struct sl_rail_channel_config_entry_attr
 * @brief A channel configuration entry attribute structure. Items listed
 *  are designed to be altered and updated during run-time.
 */
struct sl_rail_channel_config_entry_attr {
  /** IR calibration attributes specific to each channel configuration entry. */
 #if     SL_RAIL_SUPPORTS_OFDM_PA
  sl_rail_ir_cal_values_t rx_ir_cal_values;
 #else//!SL_RAIL_SUPPORTS_OFDM_PA
  sl_rail_rx_ir_cal_values_t rx_ir_cal_values;
 #endif//SL_RAIL_SUPPORTS_OFDM_PA
};

/** @} */ // end of group Calibration_EFR32XG2X

/******************************************************************************
 * Transmit
 *****************************************************************************/
/**
 * @addtogroup PA_EFR32XG2X EFR32xG2x
 * @ingroup PA
 * @{
 * @brief Types specific to the EFR32xG2x for dealing with the on-chip PAs.
 */

#ifndef SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX
#if _SILICON_LABS_32B_SERIES_2_CONFIG == 1
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX  (180U)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MIN  (1U)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_MP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_MP_MAX  (90U)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_MP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_MP_MIN  (1U)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LP_MAX  (64U)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LP_MIN  (0U)
#elif ((_SILICON_LABS_32B_SERIES_2_CONFIG == 4) || (_SILICON_LABS_32B_SERIES_2_CONFIG == 6))
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 *  EFR32xG24: capable of 20dBm max output power has max powerlevel:180
 *  EFR32xG24: capable of 10dBm max output power has max powerlevel:90
 *  EFR32xG26: capable of 20dBm max output power has max powerlevel:180
 *  EFR32xG26: capable of 10dBm max output power has max powerlevel:90
 */
#if defined (_SILICON_LABS_EFR32_2G4HZ_HP_PA_PRESENT) \
  && (_SILICON_LABS_EFR32_2G4HZ_HP_PA_MAX_OUTPUT_DBM > 10)
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX  (180U)
#else
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX  (90U)
#endif
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MIN  (0U)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LP_MAX  (15U)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LP_MIN  (0U)
#elif ((_SILICON_LABS_32B_SERIES_2_CONFIG == 2) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 7)   \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 9))
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX  (127U)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MIN  (0U)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LP_MAX  (15U)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LP_MIN  (0U)
#elif _SILICON_LABS_32B_SERIES_2_CONFIG == 8
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX  (240)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MIN  (1U)
#else //EFR32xG23
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX  (240)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MIN  (1U)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_MP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_MP_MAX  (SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_MP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_MP_MIN  (SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MIN)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LP_MAX  (SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LP_MIN  (SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MIN)
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LLP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LLP_MAX  (SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX)
/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_2P4_GHZ_LLP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_LLP_MIN  (SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MIN)
#endif //_SILICON_LABS_32B_SERIES_2_CONFIG
#endif //SL_RAIL_TX_POWER_LEVEL_2P4_GHZ_HP_MAX

#if SL_RAIL_SUPPORTS_SUB_GHZ_BAND
/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when using
 * a Sub-GHz PA mode.
 */
#ifndef SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX
#if _SILICON_LABS_32B_SERIES_2_CONFIG == 3 || _SILICON_LABS_32B_SERIES_2_CONFIG == 8
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX 240U
#elif _SILICON_LABS_32B_SERIES_2_CONFIG == 5
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX 79U
#else
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX 0U
#endif
#endif//SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX

/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when using
 * a Sub-GHz PA mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MIN 1U

/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_SUB_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_HP_MAX (SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX)

/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_SUB_GHZ_HP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_HP_MIN (SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MIN)

/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_SUB_GHZ_MP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MP_MAX (SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX)

/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_SUB_GHZ_MP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MP_MIN (SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MIN)

/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_SUB_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_LP_MAX (SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX)

/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_SUB_GHZ_LP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_LP_MIN (SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MIN)

/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_SUB_GHZ_LLP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_LLP_MAX (SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MAX)

/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_SUB_GHZ_LLP mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_LLP_MIN (SL_RAIL_TX_POWER_LEVEL_SUB_GHZ_MIN)
#endif //SL_RAIL_SUPPORTS_SUB_GHZ_BAND

#if SL_RAIL_SUPPORTS_OFDM_PA
#if _SILICON_LABS_32B_SERIES_2_CONFIG == 5
#define SL_RAIL_OFDM_PA_MAX      204U
#define SL_RAIL_OFDM_PA_MULT     5U
#define SL_RAIL_OFDM_PA_MIN      0U
#endif

/**
 * The maximum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_OFDM_PA mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_OFDM_PA_MAX (SL_RAIL_OFDM_PA_MAX)

/**
 * The minimum valid value for the \ref sl_rail_tx_power_level_t when in \ref
 * SL_RAIL_TX_POWER_MODE_OFDM_PA mode.
 */
#define SL_RAIL_TX_POWER_LEVEL_OFDM_PA_MIN (SL_RAIL_OFDM_PA_MIN)
#endif //SL_RAIL_SUPPORTS_OFDM_PA

