SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/efr32xg2x/sl_rail_chip_specific.h
#ifndef DOXYGEN_UNDOCUMENTED

#if (_SILICON_LABS_32B_SERIES_2_CONFIG == 3) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 5)
// PA for Sub-GHz
#define SL_RAIL_TX_PA_MODE_SUB_GHZ (sl_rail_tx_pa_mode_t)(0U)
#else
// PA for 2.4 GHz
#define SL_RAIL_TX_PA_MODE_2P4_GHZ (sl_rail_tx_pa_mode_t)(0U)
#endif

#if _SILICON_LABS_32B_SERIES_2_CONFIG == 5
// PA for Sub-GHz OFDM
#define SL_RAIL_TX_PA_MODE_SUB_GHZ_OFDM (sl_rail_tx_pa_mode_t)(1U)
#elif _SILICON_LABS_32B_SERIES_2_CONFIG == 8
// PA for Sub-GHz
#define SL_RAIL_TX_PA_MODE_SUB_GHZ (sl_rail_tx_pa_mode_t)(1U)
#else
// no PA index 1
#endif

#endif//DOXYGEN_UNDOCUMENTED

/**
 * The number of PA's on this chip (including Virtual PAs).
 */
#ifndef SL_RAIL_NUM_PA
#if ((_SILICON_LABS_32B_SERIES_2_CONFIG == 2) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 4) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 6) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 7) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 9))
#define SL_RAIL_NUM_PA (2U)
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 3)
#define SL_RAIL_NUM_PA (4U)
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 8)
#define SL_RAIL_NUM_PA (5U)
#elif (_SILICON_LABS_32B_SERIES_2_CONFIG == 5)
#define SL_RAIL_NUM_PA (4U)
#else
#define SL_RAIL_NUM_PA (3U)
#endif
#endif //#ifndef SL_RAIL_NUM_PA

/** Boolean to indicate on number of PA modes present on a chip. */
#if ((_SILICON_LABS_32B_SERIES_2_CONFIG == 5) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 8))
#define SL_RAIL_TX_PA_MODES_COUNT 2U
#else
#define SL_RAIL_TX_PA_MODES_COUNT 1U
#endif

#ifndef DOXYGEN_SHOULD_SKIP_THIS
// Self-referencing defines minimize compiler complaints when using SLI_RAIL_ENUM
// Only those supported per-platform are defined, for use with #ifdef in
// apps or librail code.
#if     SL_RAIL_SUPPORTS_2P4_GHZ_BAND
#define SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_2P4_GHZ_HP)
#if     _SILICON_LABS_32B_SERIES_2_CONFIG == 1
#define SL_RAIL_TX_POWER_MODE_2P4_GHZ_MP ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_2P4_GHZ_MP)
#endif//_SILICON_LABS_32B_SERIES_2_CONFIG == 1
#if     ((_SILICON_LABS_32B_SERIES_2_CONFIG != 3) && (_SILICON_LABS_32B_SERIES_2_CONFIG != 8))
#define SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_2P4_GHZ_LP)
#endif//((_SILICON_LABS_32B_SERIES_2_CONFIG != 3) && (_SILICON_LABS_32B_SERIES_2_CONFIG != 8))
#define SL_RAIL_TX_POWER_MODE_2P4_GHZ_HIGHEST ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_2P4_GHZ_HIGHEST)
#endif//SL_RAIL_SUPPORTS_2P4_GHZ_BAND

#if     SL_RAIL_SUPPORTS_SUB_GHZ_BAND
#if     SL_RAIL_SUPPORTS_DBM_POWERSETTING_MAPPING_TABLE
#define SL_RAIL_TX_POWER_MODE_SUB_GHZ_POWERSETTING_TABLE ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_SUB_GHZ_POWERSETTING_TABLE)
#else//!SL_RAIL_SUPPORTS_DBM_POWERSETTING_MAPPING_TABLE
#define SL_RAIL_TX_POWER_MODE_SUB_GHZ_HP ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_SUB_GHZ_HP)
#define SL_RAIL_TX_POWER_MODE_SUB_GHZ_MP ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_SUB_GHZ_MP)
#define SL_RAIL_TX_POWER_MODE_SUB_GHZ_LP ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_SUB_GHZ_LP)
#define SL_RAIL_TX_POWER_MODE_SUB_GHZ_LLP ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_SUB_GHZ_LLP)
#endif//SL_RAIL_SUPPORTS_DBM_POWERSETTING_MAPPING_TABLE
#define SL_RAIL_TX_POWER_MODE_SUB_GHZ_HIGHEST ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_SUB_GHZ_HIGHEST)
#endif//SL_RAIL_SUPPORTS_SUB_GHZ_BAND
#if     SL_RAIL_SUPPORTS_OFDM_PA
#if     SL_RAIL_SUPPORTS_DBM_POWERSETTING_MAPPING_TABLE
#define SL_RAIL_TX_POWER_MODE_OFDM_PA_POWERSETTING_TABLE ((sl_rail_tx_power_mode_t) SL_RAIL_TX_POWER_MODE_OFDM_PA_POWERSETTING_TABLE)
#endif//SL_RAIL_SUPPORTS_DBM_POWERSETTING_MAPPING_TABLE
#endif//SL_RAIL_SUPPORTS_OFDM_PA
#endif//DOXYGEN_SHOULD_SKIP_THIS

/** Convenience macro for any mapping table mode. */
#define SL_RAIL_POWER_MODE_IS_ANY_DBM_POWERSETTING_MAPPING_TABLE(x) \
  (((x) == SL_RAIL_TX_POWER_MODE_OFDM_PA_POWERSETTING_TABLE)        \
   || ((x) == SL_RAIL_TX_POWER_MODE_SUB_GHZ_POWERSETTING_TABLE))

/** Convenience macro to check if the power mode supports raw setting. */
#define SL_RAIL_POWER_MODE_SUPPORTS_RAW_SETTING(x)           \
  (((x) != SL_RAIL_TX_POWER_MODE_OFDM_PA_POWERSETTING_TABLE) \
   && ((x) != SL_RAIL_TX_POWER_MODE_SUB_GHZ_POWERSETTING_TABLE))

/** @} */ // end of group PA_EFR32XG2X

/******************************************************************************
 * RX Channel Hopping
 *****************************************************************************/
/**
 * @addtogroup Rx_Channel_Hopping_EFR32XG2X EFR32xG2x
 * @ingroup Rx_Channel_Hopping
 * @{
 * @brief EFR32xG2x-specific RX channel hopping.
 */

#if _SILICON_LABS_32B_SERIES_2_CONFIG == 8
/// The static amount of memory needed per channel for channel hopping, measured
/// in 32 bit words, regardless of the size of radio configuration structures.
#define SL_RAIL_CHANNEL_HOPPING_BUFFER_WORDS_PER_CHANNEL (65U)
#else
/// The static amount of memory needed per channel for channel hopping, measured
/// in 32 bit words, regardless of the size of radio configuration structures.
#define SL_RAIL_CHANNEL_HOPPING_BUFFER_WORDS_PER_CHANNEL (56U)
#endif

#if     (SL_RAIL_CHANNEL_HOPPING_BUFFER_WORDS_PER_CHANNEL \
         > SL_RAIL_CHANNEL_HOPPING_BUFFER_WORDS_PER_CHANNEL_WORST_CASE)
#error "Update sl_rail_types.h SL_RAIL_CHANNEL_HOPPING_BUFFER_WORDS_PER_CHANNEL_WORST_CASE"
#endif

/** @} */  // end of group Rx_Channel_Hopping_EFR32XG2X

/******************************************************************************
 * Sleep Structures
 *****************************************************************************/
/**
 * @addtogroup Sleep_EFR32XG2X EFR32xG2x
 * @ingroup Sleep
 * @{
 * @brief EFR32xG2x-specific Sleeping.
 */

/// Default PRS channel to use when configuring sleep
#define SLI_RAIL_TIMER_SYNC_PRS_CHANNEL_DEFAULT  (7U)

#if ((_SILICON_LABS_32B_SERIES_2_CONFIG == 2) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 7) \
  || (_SILICON_LABS_32B_SERIES_2_CONFIG == 9))
/// Default RTCC channel to use when configuring sleep
#define SLI_RAIL_TIMER_SYNC_RTCC_CHANNEL_DEFAULT (1U)
#else
/// Default RTCC channel to use when configuring sleep
#define SLI_RAIL_TIMER_SYNC_RTCC_CHANNEL_DEFAULT (0U)
#endif

/** @} */ // end of group Sleep_EFR32XG2X

/******************************************************************************
 * State Transitions
 *****************************************************************************/
/**
 * @addtogroup State_Transitions_EFR32XG2X EFR32xG2x
 * @ingroup State_Transitions
 * @{
 * @brief EFR32xG2x-specific State Transitions.
 */

/**
 * @def SL_RAIL_MINIMUM_TRANSITION_US
 * @brief The minimum value for a consistent RAIL transition.
 * @note Transitions may need to be slower than this when using longer
 *   \ref sl_rail_tx_power_config_t::ramp_time_us values.
 */
#define SL_RAIL_MINIMUM_TRANSITION_US (100U)

/**
 * @def SL_RAIL_MAXIMUM_TRANSITION_US
 * @brief The maximum value for a consistent RAIL transition.
 */
#define SL_RAIL_MAXIMUM_TRANSITION_US (1000000U)

#ifndef DOXYGEN_UNDOCUMENTED
/**
 * Internal Radio State type mapping for EFR32 chips.
 */
typedef sl_rail_radio_state_efr32_t sl_rail_rac_radio_state_t;
#endif//DOXYGEN_UNDOCUMENTED

/** @} */ // end of group State_Transitions_EFR32XG2X

#ifdef __cplusplus
}
#endif

#endif //SL_RAIL_TYPES_H

#endif //SL_RAIL_CHIP_SPECIFIC_H

#endif //SLI_LIBRARY_BUILD
